app/Models/AdminModel.php

    public function getAdminByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'groot53@admin.in'
 LIMIT 1

    public function changePassword($email, $newPassword)
    {
        $this->where('email', $email)
            ->set('password', $newPassword)
            ->update();
---
UPDATE `admins` SET `password` = '12345'
WHERE `email` = 'groot53@admin.in'