app/Models/StudentModel.php

SELECT *
FROM `students`
---
    public function getAllStudents()
    {
        return $this->findAll();