app/Models/TeacherModel.php

    public function getTeacherByEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `teachers`
WHERE `email` = 'sachin@gmail.com'
 LIMIT 1

    public function getAllTeachers()
    {
        return $this->findAll();
---
SELECT *
FROM `teachers`

    public function updateTeacher($email, $data)
    {
        return $this->update($email, $data);
---
UPDATE `teachers` SET `first_name` = 'Sachin KL', `last_name` = 'Kumar', `email` = 'sachin@gmail.com', `address` = 'South Delhi- 01', `gender` = 'male', `course` = 'DAA'
WHERE `teachers`.`email` IN ('sachin@gmail.com')

    public function deleteTeacher($email)
    {
        return $this->where('email', $email)->delete();
---
DELETE FROM `teachers`
WHERE `email` = 'sachin@gmail.com'